CSI API ETABS v1
cCombo.Add Method
 Adds a new load combination.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Add(
	string Name,
	int ComboType
)
Function Add (
	Name As String,
	ComboType As Integer
) As Integer
Dim instance As cCombo
Dim Name As String
Dim ComboType As Integer
Dim returnValue As Integer
returnValue = instance.Add(Name, ComboType)
int Add(
	String^ Name,
	int ComboType
)
abstract Add :
        Name : string *
        ComboType : int -> int
Parameters
Name
Type: System.String
 The name of a new load combination.
ComboType
Type: System.Int32
 This is 0, 1, 2, 3 or 4 indicating the load combination type.
0 = Linear Additive
1 = Envelope
2 = Absolute Additive
3 = SRSS
4 = Range Additive
Return Value
Type: Int32
 Returns zero if the load combination is successfully added, otherwise it returns a nonzero value.
Remarks
 The new load combination must have a different name from all other load combinations and all load cases. If the name is not unique, an error will be returned.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combo
       ret = SapModel.RespCombo.Add("COMB1", 1)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cCombo Interface
ETABSv1 Namespace